Revit 2026 API

# BuiltInFailuresToposolidBooleanPerturbationFailures Class

---

SystemObject Autodesk.Revit.DBBuiltInFailuresToposolidBooleanPerturbationFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ToposolidBooleanPerturbationFailures
```
```vb
Public NotInheritable Class ToposolidBooleanPerturbationFailures
```
```cpp
public ref class ToposolidBooleanPerturbationFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ToposolidBooleanPerturbationFailures = class end
```

The BuiltInFailuresToposolidBooleanPerturbationFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NonPerturbationBooleanFailed | Boolean operation failed without perturbation. |

#### Reference

Autodesk.Revit.DB Namespace